Fabrication part is too large to fit on the sheet metal. Replace the part with multiple smaller parts, or notify the CAM operator.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
 Syntax
  C#
public static FailureDefinitionId FabricationOverSizedCheck { get; }
  Visual Basic
Public Shared ReadOnly Property FabricationOverSizedCheck As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ FabricationOverSizedCheck {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures MEPFabricationFailures Class
  Autodesk.Revit.DB Namespace